## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/7bcedb63-df69-41f8-9394-92c998db93d6).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/core | Success :thumbsup:
**Dir**: layers/core
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmpa4at79xz/plan`

```diff
2024-12-02T21:56:02.835Z [INFO]  OpenTofu version: 1.8.4
2024-12-02T21:56:02.835Z [DEBUG] using github.com/hashicorp/go-tfe v1.36.0
2024-12-02T21:56:02.835Z [DEBUG] using github.com/opentofu/hcl/v2 v2.0.0-20240416130056-03228b26f391
2024-12-02T21:56:02.835Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.1
2024-12-02T21:56:02.835Z [DEBUG] using github.com/zclconf/go-cty v1.14.4
2024-12-02T21:56:02.835Z [INFO]  Go runtime version: go1.21.11
2024-12-02T21:56:02.835Z [INFO]  CLI args: []string{"/usr/local/lib/tofuenv/versions/1.8.4/tofu", "show", "/tmp/tmpa4at79xz/plan"}
2024-12-02T21:56:02.835Z [DEBUG] Attempting to open CLI config file: /github/home/.tofurc
2024-12-02T21:56:02.835Z [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2024-12-02T21:56:02.835Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2024-12-02T21:56:02.835Z [DEBUG] ignoring non-existing provider search directory /github/home/.terraform.d/plugins
2024-12-02T21:56:02.835Z [DEBUG] ignoring non-existing provider search directory /github/home/.local/share/terraform/plugins
2024-12-02T21:56:02.835Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2024-12-02T21:56:02.835Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2024-12-02T21:56:02.835Z [DEBUG] Found the config directory: /github/home/.terraform.d
2024-12-02T21:56:02.836Z [INFO]  CLI command args: []string{"show", "/tmp/tmpa4at79xz/plan"}
2024-12-02T21:56:02.928Z [DEBUG] checking for provisioner in "."
2024-12-02T21:56:02.928Z [DEBUG] checking for provisioner in "/usr/local/lib/tofuenv/versions/1.8.4"
2024-12-02T21:56:02.928Z [DEBUG] created provider logger: level=debug
2024-12-02T21:56:02.928Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:56:02.942Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 args=[".terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0"]
2024-12-02T21:56:02.943Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=812
2024-12-02T21:56:02.943Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0
2024-12-02T21:56:02.953Z [INFO]  provider.terraform-provider-cloudflare_v4.47.0: configuring server automatic mTLS: timestamp=2024-12-02T21:56:02.953Z
2024-12-02T21:56:02.968Z [DEBUG] provider: using plugin: version=6
2024-12-02T21:56:02.968Z [DEBUG] provider.terraform-provider-cloudflare_v4.47.0: plugin address: address=/tmp/plugin2042289263 network=unix timestamp=2024-12-02T21:56:02.968Z
2024-12-02T21:56:03.011Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:56:03.013Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=812
2024-12-02T21:56:03.013Z [DEBUG] provider: plugin exited
2024-12-02T21:56:03.013Z [DEBUG] created provider logger: level=debug
2024-12-02T21:56:03.013Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:56:03.018Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null args=[".terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null"]
2024-12-02T21:56:03.019Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=821
2024-12-02T21:56:03.019Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null
2024-12-02T21:56:03.022Z [INFO]  provider.terraform-provider-null: configuring server automatic mTLS: timestamp=2024-12-02T21:56:03.022Z
2024-12-02T21:56:03.037Z [DEBUG] provider: using plugin: version=5
2024-12-02T21:56:03.037Z [DEBUG] provider.terraform-provider-null: plugin address: address=/tmp/plugin1130673304 network=unix timestamp=2024-12-02T21:56:03.037Z
2024-12-02T21:56:03.047Z [DEBUG] No provider meta schema returned
2024-12-02T21:56:03.048Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:56:03.049Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=821
2024-12-02T21:56:03.049Z [DEBUG] provider: plugin exited
2024-12-02T21:56:03.049Z [DEBUG] created provider logger: level=debug
2024-12-02T21:56:03.049Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:56:03.054Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 args=[".terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1"]
2024-12-02T21:56:03.055Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=830
2024-12-02T21:56:03.055Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1
2024-12-02T21:56:03.104Z [INFO]  provider.terraform-provider-akash_v0.1.1: configuring server automatic mTLS: timestamp=2024-12-02T21:56:03.104Z
2024-12-02T21:56:03.123Z [DEBUG] provider: using plugin: version=5
2024-12-02T21:56:03.123Z [DEBUG] provider.terraform-provider-akash_v0.1.1: plugin address: address=/tmp/plugin2813275808 network=unix timestamp=2024-12-02T21:56:03.123Z
2024-12-02T21:56:03.141Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:56:03.305Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x8b     \xff\x94UmlG\xe6\xcew\xf6\xf8\xfcq\xaf\xcf\xf6\xf9\xcd\xf9k=\xb6\xdb\xf35\xde\xf5m\xec|\x94$M\xe2VD\x94T\x89\xa2\xaa\xccfo|^eo\xf74\xbbw\x89\xffݏU $@\x82@*\xc2\xd2\xa5\xaaT\x85*Q($H (\xadTZT*\x88"\x88\x91\xcd\xec}91N\xfb#\xd1y\x9e\xafw\xdeyg\xf6\xf0\xb7\xbfy\xeb\xf4\xdf\xff\xf8\xe7\xd3\x8b\x90\x84c\xd2\x91\xa537\xff\xba\xfc\xf9\xf3\x8b\x95\xf3\xefD(\x90\xbe\xfe\xfc\xcf\xdah\x94\x84\xe0\xf9e	A\xa3J;M\x920\x9e\xbdr\xad\x8dFH8\x8d\x926\xb8\x92\x8c0t`\x87B2\x84\xb4A'v*1
2024-12-02T21:56:03.305Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xa4\xbf\xf2\xfe5\xe1\x81\xef\x86%+]\xd8%\xb1\x9e\xbe\xfc+\x81E\xe1!\x89E\xa1\xbb\x95
2024-12-02T21:56:03.305Z [DEBUG] provider.terraform-provider-akash_v0.1.1: $\x8a/\xbcw]`\xed\xf0\xa5@\xd7\xbdث\xc4i\x92\xb4\xe3ko_\xf9 4J|\xa8; \x94\xbe!\x98P\xe24N:\xf0\xc2\x92\xdb	\x8e\x8c\xe8\x84~\xecW\xe2\xc1\xdc~_D\xc4\xe0B\xb7\xc4b0\x80\xca \x8d\x93N<\xff\xe6\xd9(\x8d\x90.\xc8J\xa8\x92\x98T\x86(\x90\xber\xe9Q%\xddp1\xa8\xacQ\xd9F\x81t\xe1Ͽ\xff\xa2\xc0z\xe0\xe5 \xeb\x81\xa6\x94a
2024-12-02T21:56:03.305Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xa4_~\xf5\x92\xc0z\xe1\xc7A\xbd\xbd0\x82#\xca(\x8d\x93|\xf1\xe2%\x87\xb2\x8c\x8b\xc3\x8eI\xa8\xdf;\xb3\x87F@BB \xe38\xae(H/^\xffj\x98FI\xdc\xfb`'\x9a@\x818\xc8X<n\x8bD\xdb;Hg\xac\xab\xbb\xa7Wl\xf0\xdc/^\xdb\xc1\xefB\xa2@\xfa\xf0;\xf53\xfa^B4N\xf8\xc2o\xdfN@I\x86&`'\x95)\x9a$\xfd\xf8\xeasw\xd4\x934J\xe0\xad`\xa3\xfd0\x8d\xd3\xcaT\x86\x90xR\xa6@\xf0\xcbw\xfe#\xa2\xe1\\xc0\x844\xa6%6\x88\xeb\xf56\x8aV%\x92\xf5\x92{ \xdcI\xf4\xd6N\xe2\xad_\xd6
2024-12-02T21:56:03.305Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xfe\x93(8I\x86\xf0\xd9\xcb\xd7D\xf5|K\xacA\xfco}#?\xb2/\xffS\x8eQ^*H\xc2\xce\xc81J\xe1\xb9\xe4h\xc1 \x8d\x84c2\x98\x91c\x84\xf0>"ge\xcfޖ>\xdb\xe0퀵\xb6\xe3v9b#\xf8\x87\xbbդ`T6+\xb38\xab\xa8\xc8(>\xfb\xe6рa\xb8\xd2.\xb1a\xd0PS\xe6h\x9c\x8c\xe1K7n\xd9|ZB#\x90Ŭ\x84\xc6\xf1G\xe7\xfe%\xa0Q\xd8)\xa1Q\xd0QWvP 
2024-12-02T21:56:03.305Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xbe\xf1\xd3\x85\xe3\\xea\x92\xd8\xcc㼲@G\xc9~\xfd\xec\xbb%\xe3\xb0\xa3Q\xa2\xc01!\xe0\x81\xb8\xc0\xe3\xb0w*B؅\xbb\xe4\xaf	؍\xbb\x95=\xc5W\xae\xdcb
2024-12-02T21:56:03.305Z [DEBUG] provider.terraform-provider-akash_v0.1.1: _\x86\x89£\xf8\xa8\xf2I
2024-12-02T21:56:03.305Z [DEBUG] provider.terraform-provider-akash_v0.1.1: d\xf2η\xc4\xe8N\xc2z\xb0\x8dI؋{\x95}\xc8\xbe\xf4{\x89M\xc1\xafl
2024-12-02T21:56:03.307Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xf6\xe3~\x89M\xe3\xd5\xdfHl\xba\xbe\xfdixS\xf6%R\xf5\xd3\xeeKad[jxdtl\\x99\xa0\x93S\xd3) !\xa8T*a\xac\\xb9ٓ>\xb0;\x94 a\xa8\xfc\xe5΍\xab\xd5q\xac\x9c\xf9\xf7\x8d\xab\xd5\xf1\xf4\xc1T\x8a\xb4A\xa5RY\xafV\xab\xd5j+g*\xeb\xd5j\xb5Z\xa5\xe9\x9f\xd0;<\xa3P\xb4\x99\xa7GM\xb7\xe4\xf8z\x9bY,\xe9]\x8e\xe1\xb83]'\xe7\xe9\xd3&_+\xfa\xae\xc6l\xdb*\xfa\x96\xa9Y\x8eϸc\xd8ڊe\xf8jqA\xcf)\xd9\xfav\x93oAӊzvy\xc52\xfc\x9d\xf3j\xde\xd5\xe7L\xbe[Mg\x96\xf4\xec6+0ǟQ\x8f\x94\xec\x94!\xfd\x85\xf1\x8e\xffk\xecX\x9e\xcf̚\xf5\x92k	\xe3\xc7\xdd\xd2q\x9b\xe9?@\xd4p\xdf\xf5 \xe2F\xf7\xa3\xa6a\xfcH\xc9\xf6\xf5\xf4=BU\xf4c\xb1\xc4ˬ\xc6:dxL2\x87\xeea6\xb2\xb1\x989\xcfP=+\xef|\x8a9\x8c[\xa6>؊h\x9ew\xf5\xbe\xd6e)Ї[\x97\xe6\xb2\xe3^\xe1~\xfeQ+\xef\xe8\xe3\xad|\xb19n\x95\x9f=\xc9\xd6f\xc2h\x8dpjan\x8f\xbaș\xe1\xb3E\xc6}k\xc52\x9f\xe9\xfd-p\xc0ɻ\xfa#y\xcb_-WM\xb7\xa0\xadުe\xba\xbc\xa8\xe5\xdd٢]\xca[\x8e\x9ag\xe3F`\xa4\xcfnM>PΪ\xf3\xea\xbcV\xf0mOxOmMW\x8f2^f\xba\xb65\xabn\xea	2\xb6\x876\xf8\x8csc\xc5\xe5\x85Z\xe5\xb3yW\xf3W\x8a\xdc\xf5\xdd\xf2\x82\xe6\xaf,\xd4\x82\xd0#\xd5\xe3@yNݣf7\xb3\xfa\xf8%y\xb9ZY\xd7j\xadm\xd4\x94\xf4\xf8G+)\xf08P\xd6\xd5\xec.u\xae\xe6\x94"\x9a\xb3\xe7\xe3\xb8\xd4Ե\x9et\xcbQ\xc5\xba\xd2\xd2M\xe3\xb3\xc6	\xc3[\xd5,r\xbay\xc9\xf1\xad\xf8\xf1\xda_Z\x91\xbb\xa6\x807\x8cb\xd1\xe0{b\xb19\xafG\xd1c\xa6|-6h\x96\xeeӤj\xe3+\x86K:\xb6\xf8\xd5o\x97o{⟨ \xd9B\xff\xfc\xc2ܞ'\xd9ڒa\xf1\x86Mp3ˌ[+k\xf5\xbb[\xbf!\xad\xd8=\x8b\x9f\x93\x82\xe6\xc3 \xef\xb0x\xf0\xe8SY}\xb2%60?l89o\xd58\xc1\xc4%6\xfcgz\xa2IҌ\x92\xbf\xaa\xe6]}_sMMg\x82amJ}\xc3g\xc7>s4\xbbcF\xe5\xcc\xc8-\xdas\xfc\xd6\xcb=Քk\xab\xf5\xc4\xe5\xc0fٷ\xbd\xec\x92m\xb2\xb6iX\xe8t\x83d\xd1u\x9c5\xb0mT\xa7\x8f59\xf7\x85\x8b\xd8֦\xa4k\x8d\x84E\xd7\xf1\xd9)CSLבS\xb6\x99\xb0[\x8e4\xd3\xee\x92\xbe?\xef\xbay[\xdc\xdbp\xf2\xaa\xcb\xf3Z\x9eM\xcd\xe4,\xc7\xdf2l\xa1\xf2mo\x91\xb3\x9c7܅\x96\xbde7\xd7\xcbgi\xb7:\xd7\xeaS\xbd\xbd\x9bK\xb4Ʒ\xda\xe7\x86\xe3]\xee\xabO\xb1\x93\xf2\xf6\xf3c\xf5%\xfd\xe0\xe6\xeaF\xe0\xfd.ڪ\xef\xf5\xdaa\x8b~\xeb\x9b[\xa8\xe9L6\xa3:\xec\xe4\xe1cǖ\xf4flzsM#68s\xe1\xaen\xcelqgk\xb3\xcf'Ÿ\xe8\xdbȗU\xa9+%\xc7ܡ?\xaa}\xb4\x93.?\xe1\x93i\xb6\xb1Ƹ\xa7\x99.g\x9a\xdax\x9a\xc4c#\x9f&O\xe3,oy>_k\x82\xaa\xe5jv\xa9\xc0N\xb2\xe3Z\xf0rͩY5\xabٖS:\xb5lr;\xe7[?\xb9\xe5\xb2\xe4\xea\xedO\x97s\x9e\xfb\x8c{\xba\xec\xady\xa6a\xdb\xcf\xfc/  \xff\xff\xe9\xc2\xe9̌  
2024-12-02T21:56:03.307Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=830
2024-12-02T21:56:03.307Z [DEBUG] provider: plugin exited

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = [
+               "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
